import React from 'react';
import './aboutUs.css'; // Create or update this file accordingly

const AboutUs = () => {
    return (
        <div className="about-wrapper">
            <div className="about-content">
                <img src="/images/za%20NAS.jpg" alt="About Us" className="about-img" />
                <span className="about-text">
                   Меморијалниот турнир во мал фудбал што се одржува во Облешево претставува спортски настан со особена емоционална вредност. <br/> <br/>Турнирот е основан од роднини, другари и пријатели на прерано починатиот Андреј Митев, како и од сите оние кои го почитуваа и ги негуваа вредностите што тој ги претставуваше – искреност, другарство, храброст и несебична поддршка.
                    <br/> <br/>
Андреј Митев ќе остане запаметен како скромен и добродушен човек, кој секогаш беше тука за другите – насмевнат, позитивен и секогаш подготвен да помогне. Неговата искрена поврзаност со луѓето беше еден од главните мотиви за организирање на овој турнир.
                    <br/><br/>

Преку оваа спортска манифестација, неговите најблиски и пошироката заедница продолжуваат да го одржуваат живо неговото сеќавање. Турнирот не е само натпреварување – тој е симбол на заедништво, почит и љубов. Секоја година, овој настан собира фудбалски екипи од различни места, создавајќи атмосфера на фер-плеј, почит и спортски дух.
                    <br/><br/>


Организацијата на турнирот постојано се унапредува и се стреми да биде на ниво достојно на споменот за Андреј. Нашата мисија е преку добра организација и искрено вложување, да создадеме настан кој ќе продолжи да ја раскажува приказната за едно исклучително момче и ќе ги поттикнува младите да ги негуваат вредностите што ги симболизираше тој.
                </span>
            </div>
        </div>
    );
};

export default AboutUs;
