import React from 'react';
import './registration.css';

const Registration = () => {
    return (
        <div className="registration-wrapper">
            <div className="registration-content">
                <h2>ПРИЈАВУВАЊЕ НА ЕКИПИ</h2>
                <p>
                    За учество на Меморијалниот турнир во мал фудбал во чест на Андреј
                    Митев, потребно е да се запознаете со правилата за учество. Овие
                    правила ќе ви помогнат да се информирате за условите на турнирот и
                    да бидете сигурни дека вашиот тим е подготвен за настап.
                </p>
                <p>
                    Пријавувањето може да го направите преку телефонските броеви или
                    официјалниот е-маил на турнирот подолу.
                </p>

                <div className="rules">
                    <h3>Правила:</h3>
                    <ul>
                        <li>Натпреварот се игра 5+1 играч</li>
                        <li>Измените се летечки, се вршат на центарот и не се ограничени.</li>
                        <li>Натпреварите се играат 2 x 20 минути со право на тајм аут од 1 минута во двете полувремиња.</li>
                        <li>Голманот не смее да ја префрли топката преку центар доколку топката е во гол аут. Доколку е во игра може да ја префрли преку центар.</li>
                        <li>Шестиот фаул е пенал од 10 метри, секој следен прекршок е пенал.</li>
                        <li>Пенал се изведува од 6 метри.</li>
                        <li>Екипата е должна да прикаже список од најмногу 10 лица и списокот е конечен по завршувањето на последниот натпревар од групаната фаза.</li>
                        <li>Играч кој ќе добие директен црвен картон, нема право на настап за следен натпревар.</li>
                        <li>Во елиминацискиот систем доколку е нарешено се изведуваат по три пенали од 6 метри.</li>
                        <li>Доколку екипата задоцни 15 минути по определеното време го губи натпреварот службено со 3:0.</li>
                    </ul>
                </div>



                <div className="contact-info">
                    <h3>Броеви за пријавување:</h3>
                    <p>Име: +389 078/123-456</p>
                    <p>име: +389 071/654-321</p>

                    <h3>Контакт е-маил:</h3>
                    <p>
                        <a href="mailto:mailovde@gmail.com">
                            mailovde@gmail.com
                        </a>
                    </p>

                </div>
                <a href="mailto:mailovde@gmail.com" className="contact-link">
                    Пријавете се преку е-маил
                </a>
            </div>
        </div>
    );
};

export default Registration;
